node-mysql/node_mysql_post_10.yml
---
services:
- module: monitoring
  ^local:
  server-agent:
  - address: node:4444
    logging: True
    metrics:
    - cpu
    - memory
    - network
execution:
- executor: jmeter 
  concurrency: 10
  ramp-up: 1m
  hold-for: 2m
  scenario:
    requests:
    - url: http://node:3000/people
      method: POST
      headers:
        Content-Type: application/json
      body: '{"firstName": "John", "lastName": "Smith", "email": "john.smith@email.com"}'